const nps = {
  list: [
    {
      id: "valera",
      name: "Валера",
      products: {
        item1: ["Малое зелье лечения", 5],
        item2: ["Среднее зелье лечения", 15],
        item3: ["Большое зелье лечения", 30],
        item4: ["Зелье маны", 10],
        item5: ["Зелье силы", 40],
        item6: ["Антидот", 8],
        item7: ["Щит", 20],
        item8: ["Меч", 25],
        item9: ["Лук", 25],
        item10: ["Тротил", 50],
        item11: ["Ключ", 100],
        item12: ["Книга чар", 150],
        item13: ["Посох", 120],
        item14: ["Артефакт1", 500], //еще не придумал
        item15: ["Аксессуар1", 200], //еще не придумал
      },
    },
    {
      id: "yorick",
      name: "Ёрик",
      quests: {
        // [Цель, Количество, Золото]
        q1: ["Слизень", 5, 20],
        q2: ["Гоблин", 3, 50],
        q3: ["Разбойник", 2, 80],
        q4: ["Мимик", 1, 150],
        q5: ["Рыцарь смерти", 1, 500],
      },
    },
  ],
};

if (typeof module !== "undefined") module.exports = nps;
