const nps = {
  list: {
    valera: {
      id: "valera",
      name: "Валера",
      products: {
        item1: ["дубинка", 10],
        item2: ["кинжал", 15],
        item3: ["меч", 25],
        item4: ["тяжелый меч", 25],
        item5: ["большой меч", 25],
        item6: ["лук", 25],
        item7: ["тяжелый меч", 50],
        item8: ["посох", 40],
        item9: ["ученический жезл", 30],
        item10: ["огненный жезл", 70],
        item11: ["посох старейшины", 120],
        item12: ["архимагический посох", 300],
        item13: ["деревяный щит", 20],
        item14: ["ржавый щит", 35],
        item15: ["железный щит", 45],
        item16: ["башенный щит", 90],
        item17: ["кожанка", 25],
        item18: ["Артефакт1", 500],
        item19: ["Аксессуар1", 200],
      },
    },

    yorick: {
      id: "yorick",
      name: "Ёрик",
      quests: {
        // [Цель, Количество, Золото]
        q1: ["Слизень", 5, 20],
        q2: ["Гоблин", 3, 50],
        q3: ["Разбойник_воин", 2, 80],
        q4: ["Мимик", 1, 150],
        q5: ["Рыцарь_смерти", 2, 450],
        q6: ["Лич", 3, 250],
        q7: ["Скелет", 10, 300],
        q8: ["Агрессивный_искатель", 4, 200],
        q9: ["Кобальт", 4, 100],
        q10: ["Минотавр", 2, 400],
      },
    },
    bab_zinu: {
      id: "bab_zinu",
      name: "Баб Зига",
      heal: {
        // [процент хила,  Золото]
        heal1: ["25%", 50, 25],
        heal2: ["50%", 100, 50],
        heal3: ["75%", 150, 75],
        heal4: ["100%", 200, 100],
      },
    },
  },
};

if (typeof module !== "undefined") module.exports = nps;
